In [1]:
import sys
sys.path.append('/home/ranvir/AiCore')
from pagila_connection import execute_query

<h2 style="color: rgb(241, 90, 36)"><img src="https://github.com/AI-Core/Content-Public/blob/main/Content/units/Data-Handling/3.%20SQL/8.%20CRUD%20Altering%20Tables/images/SQLIcon.png?modified=223&raw=1" width=80px height=80px style="vertical-align: middle;">CRUD Altering Tables</h2>

After you have inserted data into your database tables, there of course might be a need to alter, or insert new data. In this notebook you will learn how you can update your tables using **CRUD operations**.

## Adding/removing columns

When updating a table you can add or drop columns, rows or completely change data points, as long as the data matches the correct type and the constraints are met.

Manipulations of columns are done using the `ALTER TABLE` statement with the following syntax:

In [ ]:
ALTER TABLE {table_name}
    ADD COLUMN {column name} {data_type} {constraint};

Adding a new `available` column to signify that a film is available for rental:

In [ ]:
ALTER TABLE rental
    ADD COLUMN available BOOLEAN NOT NULL DEFAULT True;

In [2]:
execute_query('SELECT * FROM rental;')

       rental_id         rental_date  inventory_id  customer_id         return_date  staff_id         last_update  available
0              2 2005-05-24 22:54:33          1525          459 2005-05-28 19:40:33         1 2006-02-16 02:30:53       True
1              3 2005-05-24 23:03:39          1711          408 2005-06-01 22:12:39         1 2006-02-16 02:30:53       True
2              4 2005-05-24 23:04:41          2452          333 2005-06-03 01:43:41         2 2006-02-16 02:30:53       True
3              5 2005-05-24 23:05:21          2079          222 2005-06-02 04:33:21         1 2006-02-16 02:30:53       True
4              6 2005-05-24 23:08:07          2792          549 2005-05-27 01:32:07         1 2006-02-16 02:30:53       True
...          ...                 ...           ...          ...                 ...       ...                 ...        ...
16039      16046 2005-08-23 22:26:47          4364           74 2005-08-27 18:02:47         2 2006-02-16 02:30:53       True
16040      16047 2005-08-23 22:42:48          2088          114 2005-08-25 02:48:48         2 2006-02-16 02:30:53       True
16041      16048 2005-08-23 22:43:07          2019          103 2005-08-31 21:33:07         1 2006-02-16 02:30:53       True
16042      16049 2005-08-23 22:50:12          2666          393 2005-08-30 01:01:12         2 2006-02-16 02:30:53       True
16043          1 2005-05-24 22:53:30           367          130 2005-05-26 22:04:30         1 2006-02-15 21:30:53       True

[16044 rows x 8 columns]

Notice the additional statement keyword `DEFAULT` was added with the value set to `True`. Since we set column constraint to be `NOT NULL`, we needed to set the default value as the column can't contain `NULL` values. SQL would throw an error if we didn't set this default value.

Dropping columns can also be done using the syntax:

In [ ]:
ALTER TABLE {table_name}
    DROP COLUMN {column_name} [ RESTRICT | CASCADE ];

Again we can choose to cascade the dropping of constraints and relationships if another table depends on the column.

In [ ]:
ALTER TABLE rental
    DROP COLUMN available;

In [3]:
execute_query('SELECT * FROM rental;')

       rental_id         rental_date  inventory_id  customer_id         return_date  staff_id         last_update
0              2 2005-05-24 22:54:33          1525          459 2005-05-28 19:40:33         1 2006-02-16 02:30:53
1              3 2005-05-24 23:03:39          1711          408 2005-06-01 22:12:39         1 2006-02-16 02:30:53
2              4 2005-05-24 23:04:41          2452          333 2005-06-03 01:43:41         2 2006-02-16 02:30:53
3              5 2005-05-24 23:05:21          2079          222 2005-06-02 04:33:21         1 2006-02-16 02:30:53
4              6 2005-05-24 23:08:07          2792          549 2005-05-27 01:32:07         1 2006-02-16 02:30:53
...          ...                 ...           ...          ...                 ...       ...                 ...
16039      16046 2005-08-23 22:26:47          4364           74 2005-08-27 18:02:47         2 2006-02-16 02:30:53
16040      16047 2005-08-23 22:42:48          2088          114 2005-08-25 02:48:48         2 2006-02-16 02:30:53
16041      16048 2005-08-23 22:43:07          2019          103 2005-08-31 21:33:07         1 2006-02-16 02:30:53
16042      16049 2005-08-23 22:50:12          2666          393 2005-08-30 01:01:12         2 2006-02-16 02:30:53
16043          1 2005-05-24 22:53:30           367          130 2005-05-26 22:04:30         1 2006-02-15 21:30:53

[16044 rows x 7 columns]

<h3 style="color: rgb(241, 90, 36)">Renaming columns and tables</h3>

You might want to rename columns or tables if they no longer make sense to the current needs of the business.

To change this name of a table use the following syntax:

In [ ]:
ALTER TABLE {table_name}
    RENAME TO {new_table_name};

Column renaming can be done with:

In [ ]:
ALTER TABLE {table_name}
    RENAME {previous_column_name} TO {new_column_name};

<h3 style="color: rgb(241, 90, 36)">Changing column types</h3>

Often column types may need to be changed, this could be due to the current data type not handling the size of the data correctly. The data type could be too small to hold the data or too large, taking up extra space. Sometimes on first insertion of data into a new table by another service or application the data types might be inferred. This can lead to data being modelled incorrectly and thus might need to be altered.

The syntax to alter the column data type is:

In [ ]:
ALTER TABLE {table_name}
    ALTER COLUMN {column_name} TYPE {data type};

We could remove the time zone from the `rental_date` column in the `rental` table by casting it to a timestamp without time zone:

In [ ]:

ALTER TABLE rental
    ALTER COLUMN rental_date TYPE TIMESTAMP without TIME ZONE;

In [6]:
execute_query('SELECT * FROM rental;')

       rental_id         rental_date  inventory_id  customer_id         return_date  staff_id         last_update
0              2 2005-05-24 22:54:33          1525          459 2005-05-28 19:40:33         1 2006-02-16 02:30:53
1              3 2005-05-24 23:03:39          1711          408 2005-06-01 22:12:39         1 2006-02-16 02:30:53
2              4 2005-05-24 23:04:41          2452          333 2005-06-03 01:43:41         2 2006-02-16 02:30:53
3              5 2005-05-24 23:05:21          2079          222 2005-06-02 04:33:21         1 2006-02-16 02:30:53
4              6 2005-05-24 23:08:07          2792          549 2005-05-27 01:32:07         1 2006-02-16 02:30:53
...          ...                 ...           ...          ...                 ...       ...                 ...
16039      16046 2005-08-23 22:26:47          4364           74 2005-08-27 18:02:47         2 2006-02-16 02:30:53
16040      16047 2005-08-23 22:42:48          2088          114 2005-08-25 02:48:48         2 2006-02-16 02:30:53
16041      16048 2005-08-23 22:43:07          2019          103 2005-08-31 21:33:07         1 2006-02-16 02:30:53
16042      16049 2005-08-23 22:50:12          2666          393 2005-08-30 01:01:12         2 2006-02-16 02:30:53
16043          1 2005-05-24 22:53:30           367          130 2005-05-26 22:04:30         1 2006-02-15 21:30:53

[16044 rows x 7 columns]

Although casting is great for quickly converting column types, it won't work in all cases. The current data type to be cast has to be of the correct form to be cast to the new value. For example you can't cast a `timestamp` to an `integer`, but casting an `integer` to another `numerical` type like a `real` would be possible.

## Adding/Removing constraints

Constraints can also be altered after the table was created using `ALTER TABLE`. This can be used to both add and remove table constraints.

To remove constraints use the following syntax:

In [ ]:
ALTER TABLE {table_name}
    DROP CONSTRAINT {name_of_the_constraint} [ RESTRICT | CASCADE]

Table constraints can be added with:

In [ ]:
ALTER TABLE {table_name}
    ADD {table_constraint}

For example adding a constraint that the `staff_id > 0` to the `staff` table:

In [ ]:
ALTER TABLE staff
    ADD CHECK (staff_id > 0);

-- Or with a named constraint, always better to name your constraint as best practice

ALTER TABLE staff
    ADD CONSTRAINT min_staff_id CHECK (staff_id > 0);

In [8]:
execute_query('SELECT * FROM staff;').set_index('staff_id')

,first_name,last_name,address_id,email,store_id,active,username,password,last_update,picture
staff_id,,,,,,,,,,
1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793280,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'..."
2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793280,None

## Adding new rows

To add new rows to a table we can use the following syntax:

In [ ]:
INSERT INTO {table_name}
    ({column_1}, {column_2}, ....)
VALUES
    ({column_1 value}, {column_2 value}, ......);

Let's insert a new film category into the `category` table:

In [ ]:
INSERT INTO category
    (name, last_update)
VALUES
    ('Thriller', NOW());

In [11]:
execute_query('SELECT * FROM category;')

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

In [13]:
execute_query('SELECT * FROM category;').tail()

    category_id      name                last_update
12           13       New 2006-02-15 09:46:27.000000
13           14    Sci-Fi 2006-02-15 09:46:27.000000
14           15    Sports 2006-02-15 09:46:27.000000
15           16    Travel 2006-02-15 09:46:27.000000
16           17  Thriller 2023-11-06 20:11:34.311358

Important to note here that the order of `(name, last_update)` only matters when referencing the values to be inserted. In the `VALUES` clause we have input `('Thriller', NOW())` to insert the category `'Thriller'` at the current datetime `NOW()`. Since `name` comes first in the `INSERT INTO` clause `Thriller` will be inserting into the `name` column first and the timestamp `NOW()` inserted into the `last_update` column as it comes second.

This order doesn't need to reflect the ordering of the table. It just needs to be ordered in the correct way in the `INSERT INTO` and `VALUES` clauses, better seen with an example:

In [ ]:
INSERT INTO category
    (last_update, name)
VALUES
    (NOW(), 'Thriller');

In [18]:
execute_query('SELECT * FROM category;').tail(3)

    category_id      name                last_update
15           16    Travel 2006-02-15 09:46:27.000000
16           17  Thriller 2023-11-06 20:11:34.311358
17           18  Thriller 2023-11-06 20:13:48.205653

This would insert the same data, the positions of the arguments only matter in the statement itself. We also didn't include the column `id` since SQL will auto generate the `id` on table insertion.

<h4 style="color: rgb(241, 90, 36)">Inserting rows with SELECT</h4>

SQL also gives you the ability to insert rows into tables using the `SELECT` statement. The syntax is a little different from inserting rows using the `VALUES` clause. Rows can be inserted with the `SELECT` statement using the syntax:

In [ ]:
INSERT INTO {table_name}
    ({column_1}, {column_2}, ....)
(SELECT query);

Let's create a small table in the database which will contain films starting with the letter B and a few details about the films. We will use the `film` table to get the data to insert using a `SELECT` statement:

In [ ]:
CREATE TABLE b_films (
    title VARCHAR(300) UNIQUE NOT NULL,
    description TEXT NOT NULL,
    release_year INT NOT NULL,
    rating CHAR(5) NOT NULL
);

In [19]:
execute_query('SELECT * FROM b_films;')

Empty DataFrame
Columns: [title, description, release_year, rating]
Index: []

Now we can insert the data using `SELECT`. When selecting the data we need to select the same number of columns we want to insert and of the correct data type to insert or SQL will cause an error.

In [ ]:
INSERT INTO B_films(title, description, release_year, rating)

SELECT title,
        description,
        release_year,
        rating
    FROM
        film
    WHERE
        title LIKE 'B%';

In [23]:
execute_query("SELECT * FROM B_films;")

                    title                                        description  release_year rating
0               BABY HALL  A Boring Character Study of a A Shark And a Gi...          2006  NC-17
1     BACKLASH UNDEFEATED  A Stunning Character Study of a Mad Scientist ...          2006  PG-13
2             BADMAN DAWN  A Emotional Panorama of a Pioneer And a Compos...          2006  R
3         BAKED CLEOPATRA  A Stunning Drama of a Forensic Psychologist An...          2006  G
4        BALLOON HOMEWARD  A Insightful Panorama of a Forensic Psychologi...          2006  NC-17
..                    ...                                                ...           ...    ...
58         BULL SHAWSHANK  A Fanciful Drama of a Moose And a Squirrel who...          2006  NC-17
59  BULWORTH COMMANDMENTS  A Amazing Display of a Mad Cow And a Pioneer w...          2006  G
60            BUNCH MINDS  A Emotional Story of a Feminist And a Feminist...          2006  G
61          BUTCH PANTHER  A Lacklusture Yarn of a Feminist And a Databas...          2006  PG-13
62     BUTTERFLY CHOCOLAT  A Fateful Story of a Girl And a Composer who m...          2006  G

[63 rows x 4 columns]

This fills the `b_films` table with all films starting with the letter B. You can add as much complexity to the `SELECT` query as you want, allowing you to quickly insert data into a new table from other tables.

<h2 style="color: rgb(241, 90, 36)">Updating data</h2>

The `UPDATE` keyword is used to modify data already existing in the database. When combined with the `WHERE` statement you can accurately target rows or data you want to update.

The syntax to update rows has the structure:

In [ ]:
UPDATE {table_name}
SET
    {column_1} = {column_value_1}
    {column_2} = {column_value_2}
    ...
WHERE {condition}

We tell SQL which columns we want to change the values of with the `SET` keyword. Which specifies the column to change and the value to change it to. Notice in the structure of the query we can change multiple columns at once.

The `WHERE` keyword is then used as a conditional to check for the correct rows to update.

>`WHERE` conditions can match multiple rows, so there's the possibility you might update multiple rows by accident when this wasn't intended. This is more likely to happen when using a `LIKE` statement to pattern match the rows. It's preferable to use the explicit `WHERE column = '<value>'` statements to ensure targeting of the correct information.

>To avoid this, a careful way to do the update is, first use a `SELECT` and `WHERE` condition to find the rows you will use in the update. If the return rows are the rows you want to update then you can use that condition in the `UPDATE` statement.  

Let's take a look at an an example of applying an `UPDATE`, we'll first `SELECT` the rows to make sure we're targeting the correct rows then update. Let's look at the example of what can go wrong when using a `LIKE` statement. We'll try and update the row with `title = AIRPLANE SIERRA` in the `film` table. Using `LIKE` to find films starting with `AIR`:

In [ ]:
SELECT title
FROM film
WHERE title LIKE 'AIR%';

In [32]:
execute_query('''
                SELECT title
                FROM   film
                WHERE  title LIKE 'AIR%%';
            ''')

             title
0  AIRPLANE SIERRA
1  AIRPORT POLLOCK

This query actually returned two films `AIRPLANE SIERRA` and `AIRPORT POLLOCK`, let's be more specific to avoid updating with incorrect information.

In [ ]:
SELECT title
FROM film
WHERE title = 'AIRPLANE SIERRA';

In [33]:
execute_query('''
                SELECT title, rental_rate, release_year
                FROM   film
                WHERE  title = 'AIRPLANE SIERRA';
            ''')

             title  rental_rate  release_year
0  AIRPLANE SIERRA         4.99          2006

Perfect, we got an exact match, so we can use this in our `UPDATE` statement. Let's use the condition to update the `rental_rate` and the `release_year` columns. There was an error with the original data, the release year it was actually `2008` and the price has dropped to `2.99`.

In [ ]:
UPDATE film
    SET rental_rate = 2.99,
        release_year = 2010
WHERE
    title = 'AIRPLANE SIERRA';

In [35]:
execute_query('''
                SELECT title, rental_rate, release_year
                FROM   film
                WHERE  title = 'AIRPLANE SIERRA';
            ''')

             title  rental_rate  release_year
0  AIRPLANE SIERRA         2.99          2010

Since we confirmed that we were selecting the correct data using the `SELECT/WHERE` query, the `UPDATE` has been applied to the desired row.

`UPDATE` can also be used if the constraints allow, to clear the values in the rows using `NULL`:

In [ ]:
UPDATE film
    SET rental_rate = NULL,
        release_year = NULL
WHERE
    title = 'AIRPLANE SIERRA';

ERRORED OUT

null value in column "rental_rate" of relation "film" violates not-null constraint

so no change

In [36]:
execute_query('''
                SELECT title, rental_rate, release_year
                FROM   film
                WHERE  title = 'AIRPLANE SIERRA';
            ''')

             title  rental_rate  release_year
0  AIRPLANE SIERRA         2.99          2010

<h2 style="color: rgb(241, 90, 36)">Removing rows</h2>

The syntax to delete a row from a table is:

In [ ]:
DELETE FROM {table_name}
WHERE {condition};

Remember you might want to verify you're going to delete the correct rows by first performing a `SELECT` statement before running a `DELETE` statement. In this case we will delete all rows in the `actor` table where the actors `first_name` is `Ben`. Since this query is so specific we can be sure we get the result we want and may not require the `SELECT` first. If you're ever unsure remember to use the `SELECT` first before the `DELETE`.

In [ ]:
DELETE FROM actor
WHERE first_name = 'Ben';

In [40]:
execute_query('''
                SELECT * FROM actor
                WHERE first_name = 'Ben';
            ''')

Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

## Key Takeaways

- Tables can be altered in almost any fashion: dropping rows, updating column, changing data types etc
- `NULL` values in rows can be avoided by setting `DEFAULT` values for rows
- Be careful when changing the data in your table. You can use a `SELECT` statement first to check the correct data is being changed
- `CONSTRAINT`s can be added after a tables creation which can often be the case when you haven't fully modelled your data yet